CavBubbleFsiFoam/exampleCases/bubbleSheetorg/fluid/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    interface
    {
        type            wall;
        nFaces          400;
        startFace       31560;
    }
    left
    {
        type            patch;
        nFaces          40;
        startFace       31960;
    }
    front
    {
        type            wedge;
        nFaces          16000;
        startFace       32000;
    }
    back
    {
        type            wedge;
        nFaces          16000;
        startFace       48000;
    }
    wall
    {
        type            wall;
        nFaces          400;
        startFace       64000;
    }
    right
    {
        type            wall;
        nFaces          40;
        startFace       64400;
    }
)


// ************************************************************************* //
