CavBubbleFsiFoam/exampleCases/bubbleSheetorg/fluid/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidSolver unsTotalLagrangianSolid;

unsTotalLagrangianSolidCoeffs
{
    nCorrectors 1000;

    convergenceTolerance 1e-8;
    relConvergenceTolerance 1e-3;

    nonLinear totalLagrangian;
    debug no;
}

// ************************************************************************* //
